Enums/ОбъектыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ОбъектыУчета</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиПоДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ОбъектыУчета/Ext/ManagerModule.bsl
Функция ПолучитьИмяСправочника(ОбъектУчета) Экспорт
	Если ОбъектУчета = Перечисления.ОбъектыУчета.Контрагенты Тогда
		Возврат "Контрагенты";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ДоговорыКонтрагентов Тогда
		Возврат "ДоговорыКонтрагентов";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.УслугиПоДоговорам Тогда
		Возврат "УслугиПоДоговору";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ДолговыеОбязательства Тогда
		Возврат "ДолговыеОбязательства";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.ИсполнительныеДокументы Тогда
		Возврат "ИсполнительныеДокументы";
	ИначеЕсли ОбъектУчета = Перечисления.ОбъектыУчета.Залоги Тогда
		Возврат "Залоги";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьТипСправочника(ОбъектУчета) Экспорт
	Имя = ПолучитьИмяСправочника(ОбъектУчета);
	Если Имя <> Неопределено Тогда      
		Возврат Тип("СправочникСсылка." + Имя);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
